In [83]:
import os
import numpy as np
import pandas as pd

In [84]:
authors_df = pd.read_csv(os.path.join(".", "some_scv.scv"))

authors_df.head()

                 author                                          authorUrl
0           Mike Pirnat                            http://mike.pirnat.com/
1           David Mertz  http://www.oreilly.com/programming/free/functi...
2       Muhammad Yasoob                             http://pythontips.com/
3  B. Miller & D. Ranum                        http://reputablejournal.com
4     Jeffrey Elkner...                          http://greenteapress.com/

In [85]:
df = pd.DataFrame({
                    "a": [1, 2, 3],
                    "b": [4, 5, 6],
                    "c": [7, 8, 9]
                  })

df[(df.a%2==0) & (df.c%2==0)]

   a  b  c
1  2  5  8

In [86]:

authors_df[authors_df.author.str.startswith("D")]

          author                                          authorUrl
1    David Mertz  http://www.oreilly.com/programming/free/functi...
17  Dave Kuhlman                      http://www.rexx.com/~dkuhlman
25  Doug Hellman                       http://www.doughellmann.com/
54   David Mertz                             http://gnosis.cx/TPiP/

In [87]:

authors_df[(authors_df.author.str.startswith("M")) & (authors_df.authorUrl.str.contains("python"))]

            author                               authorUrl
2  Muhammad Yasoob                  http://pythontips.com/
7     Mark Pilgrim  http://getpython3.com/diveintopython3/
8     Mark Pilgrim  http://getpython3.com/diveintopython3/

In [88]:
mask = (authors_df.author.str.startswith("M")) & (authors_df.authorUrl.str.contains("python"))
authors_df.loc[mask, :]

            author                               authorUrl
2  Muhammad Yasoob                  http://pythontips.com/
7     Mark Pilgrim  http://getpython3.com/diveintopython3/
8     Mark Pilgrim  http://getpython3.com/diveintopython3/

In [89]:
df_drinks = pd.read_csv("https://raw.githubusercontent.com/ProgressBG-Python-Course/JupyterNotebooksExamples/master/datasets/various/drinks.csv")
df_drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [90]:
df_drinks.loc[1::2, "country"]

1                Albania
3                Andorra
5      Antigua & Barbuda
7                Armenia
9                Austria
             ...
183             Tanzania
185              Uruguay
187              Vanuatu
189              Vietnam
191               Zambia
Name: country, Length: 96, dtype: object

In [91]:
df_drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [92]:
# How to swap the places of the columns???
df_drinks.loc[:, ['beer_servings', 'country']] = df_drinks.loc[:, ['country', 'beer_servings']]
df_drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [93]:
# Boolean array to loc
# print(df_drinks.loc[:, [df_drinks.wine_servings>400]])
df_drinks[df_drinks.wine_servings > 300].country # Bad (memory wise)
df_drinks.loc[df_drinks.wine_servings > 300, 'country']
df_drinks.loc[(df_drinks.wine_servings > 300) & (df_drinks.country.str.startswith("F")), 'country']

61    France
Name: country, dtype: object

In [94]:
# set country value as index
df_drinks.set_index('country', inplace=True)
df_drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,AS
Albania,89,132,54,4.9,EU
Algeria,25,0,14,0.7,AF
Andorra,245,138,312,12.4,EU
Angola,217,57,45,5.9,AF

In [95]:
mask = (df_drinks.index.str.startswith("B"))
# df_drinks[mask]

df_drinks.loc[mask, ]

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Bahamas,122,176,51,6.3,NaN
Bahrain,42,63,7,2.0,AS
Bangladesh,0,0,0,0.0,AS
Barbados,143,173,36,6.3,NaN
Belarus,142,373,42,14.4,EU
Belgium,295,84,212,10.5,EU
Belize,263,114,8,6.8,NaN
Benin,34,4,13,1.1,AF
Bhutan,23,0,0,0.4,AS
Bolivia,167,41,8,3.8,SA
Bosnia-Herzegovina,76,173,8,4.6,EU
Botswana,173,35,35,5.4,AF
Brazil,245,145,16,7.2,SA
Brunei,31,2,1,0.6,AS
Bulgaria,231,252,94,10.3,EU
Burkina Faso,25,7,7,4.3,AF
Burundi,88,0,0,6.3,AF

In [96]:
df_drinks.reset_index(inplace=True)

In [97]:
df_drinks.index

RangeIndex(start=0, stop=193, step=1)

In [98]:
df_drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [99]:
df_drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [100]:
df_drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [101]:
df_drinks.mean()

C:\Users\stoya\AppData\Local\Temp/ipykernel_23760/3539279767.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_drinks.mean()

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

In [102]:
df_drinks.max()

C:\Users\stoya\AppData\Local\Temp/ipykernel_23760/274179549.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_drinks.max()

country                         Zimbabwe
beer_servings                        376
spirit_servings                      438
wine_servings                        370
total_litres_of_pure_alcohol        14.4
dtype: object

In [103]:
# Print the name of the country that serves most pure_alcohol
mask = (df_drinks.total_litres_of_pure_alcohol == df_drinks.total_litres_of_pure_alcohol.max())
df_drinks.loc[mask, 'country']

15    Belarus
Name: country, dtype: object

In [104]:
df_drinks.loc[df_drinks.country == "Bulgaria"].max(axis=1)

C:\Users\stoya\AppData\Local\Temp/ipykernel_23760/856951528.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_drinks.loc[df_drinks.country == "Bulgaria"].max(axis=1)

25    252.0
dtype: float64

In [105]:
df_drinks.total_litres_of_pure_alcohol.idxmax()

15

In [106]:
# GroupBy
df = df_drinks.groupby('continent')
df.wine_servings.max()

continent
AF    233
AS    123
EU    370
OC    212
SA    221
Name: wine_servings, dtype: int64

In [107]:
df_drinks.continent.isnull().values.any()

True

In [117]:
df_drinks.sort_values(by='continent')

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
192,Zimbabwe,64,18,4,4.7,AF
152,Seychelles,157,25,51,4.1,AF
150,Senegal,9,1,7,0.3,AF
95,Lesotho,82,29,0,2.8,AF
142,Rwanda,43,2,0,6.8,AF
...,...,...,...,...,...,...
143,St. Kitts & Nevis,194,205,32,7.7,NaN
144,St. Lucia,171,315,71,10.1,NaN
145,St. Vincent & the Grenadines,120,221,11,6.3,NaN
174,Trinidad & Tobago,197,156,7,6.4,NaN
184,USA,249,158,84,8.7,NaN